blog/saikusso.org
#+TITLE:       saiku单点登录方案
#+AUTHOR:      Will
#+EMAIL:       will@will-K42JA
#+DATE:        2014-06-12 四
#+URI:         ./blog/%y/%m/%d/saikusso
#+KEYWORDS:    saiku,sso
#+TAGS:        :sakiu:sso:
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: saiku单点登录方案

* 目录 :TOC:


* 基本思路

公司已经有了SSO 单点登陆方案。登陆成功后，浏览器中会有加密过的cookie信息。Saiku的安全机制是基于Spring security的。在Spring security中有Pre-Authentication机制。
我们要做的就是实现Pre-Authentication，通过读取公司SSO系统中的cookie信息获得登陆人，并且编写角色赋权的逻辑，然后传给spring security。这样saiku系统就会使用我们传给它的
角色来确定显示哪些cube。

* 修改Spring 配置信息

修改 /src/main/webapp/WEB-INF/applicationContext-spring-security.xml
#+BEGIN_SRC xml
<?xml version="1.0" encoding="UTF-8" ?>

<beans xmlns="http://www.springframework.org/schema/beans"
       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
       xsi:schemaLocation="http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans-3.0.xsd">

  <!-- <import resource="applicationContext-spring-security-memory.xml"/> -->
  <import resource="spring-security.xml"/>
</beans>
#+END_SRC

spring-security.xml

#+BEGIN_SRC xml
<?xml version="1.0" encoding="UTF-8"?>
<beans xmlns="http://www.springframework.org/schema/beans"
       xmlns:security="http://www.springframework.org/schema/security"
       xmlns:context="http://www.springframework.org/schema/context"
       xmlns:oauth="http://www.springframework.org/schema/security/oauth2"
       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
       xsi:schemaLocation="
                           http://www.springframework.org/schema/security http://www.springframework.org/schema/security/spring-security-3.0.xsd
                           http://www.springframework.org/schema/security/oauth2 http://www.springframework.org/schema/security/spring-security-oauth2.xsd
                           http://www.springframework.org/schema/context http://www.springframework.org/schema/context/spring-context-3.0.xsd
                           http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans-3.0.xsd">

  <context:component-scan base-package="com.standino.ipc.dashboard"/>


  <bean id="ssoHeaderFilter"
        class="com.standino.ipc.dashboard.interceptor.SSORequestHeaderAuthenticationFilter">
    <property name="principalRequestHeader" value="REMOTE_USER"/>
    <!-- <property name="authenticationManager" ref="authenticationManager"/> -->
    <!-- <property name="allowPreAuthenticatedPrincipals" value="true"/> -->
    <!-- <property name="exceptionIfHeaderMissing" value="false"/> -->
    <!-- <constructor-arg index="0" ref="userDetailsService"/> -->
    <!-- <constructor-arg index="1" ref="ssoLoginHandler"/> -->

    <!-- fall back to other authentication providers is OAM SSO is not there -->
    <property name="exceptionIfHeaderMissing" value="false" />
    <!-- hard code a testUserId for local tests -->
    <property name="testUserId" value="admin" />

    <property name="authenticationManager" ref="authenticationManager" />

    <property name="authenticationDetailsSource">
      <bean class="com.standino.ipc.dashboard.security.HeaderAuthenticationDetails">
        <!-- look for the request header set by the webgate and map to local
          roles -->
        <property name="roleHeaderName" value="ROLES" />
        <property name="userRoles2GrantedAuthoritiesMapper">
          <bean
            class="org.springframework.security.core.authority.mapping.SimpleAttributes2GrantedAuthoritiesMapper">
            <property name="convertAttributeToUpperCase" value="true" />
          </bean>
        </property>
        <!-- setup a testing role if not deployed with a webgate - this only
          applies if ENV_NAME != uat/prod -->
        <property name="testingRoles">
          <set>
            <value>ROLE_ADMIN</value>
            <value>ROLE_USER</value>
          </set>
        </property>
        <!-- all available roles for this application -->
        <property name="allRoles">
          <set>
            <value>ROLE_ADMIN</value>
            <value>ROLE_USER</value>

          </set>
        </property>
      </bean>
    </property>


  </bean>

  <bean id="preauthAuthProvider"
    class="org.springframework.security.web.authentication.preauth.PreAuthenticatedAuthenticationProvider">
    <property name="preAuthenticatedUserDetailsService" ref="preAuthenticatedUserDetailsService" />
  </bean>
  <!-- magically map the user header to a valid user object -->
  <bean id="preAuthenticatedUserDetailsService"
    class="org.springframework.security.web.authentication.preauth.PreAuthenticatedGrantedAuthoritiesUserDetailsService" />

  <bean id="securityContextHolderAwareRequestFilter"
    class="org.springframework.security.web.servletapi.SecurityContextHolderAwareRequestFilter" />


  <security:authentication-manager alias="authenticationManager">
  <security:authentication-provider ref="preauthAuthProvider" />

  <!-- this is an example of alternate user authentication providers, although
   we only have the PRE_AUTH_FILTER defined above, so it isn't used. -->
  <security:authentication-provider>
   <security:user-service>
    <security:user authorities="ROLE_USER" name="guest" password="guest" />
   </security:user-service>
  </security:authentication-provider>
  </security:authentication-manager>


  <!-- <security:authentication-manager alias="authenticationManager"> -->
  <!--   <security:authentication-provider user-service-ref='userDetailsService'> -->
  <!--     <security:password-encoder hash="plaintext" /> -->
  <!--   </security:authentication-provider> -->
  <!-- </security:authentication-manager> -->

  <bean id="userDetailsService"
        class="com.standino.ipc.dashboard.security.UserDetailsServices" />

</beans>
#+END_SRC

