blog/2014/06/12/saikusso/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>saiku单点登录方案 - Keep going</title>
  <meta charset="utf-8" />
  <meta name="author" content="Will" />
    <meta name="description" content="saiku单点登录方案" />
    <meta name="keywords" content="saiku,sso" />

  <link rel="stylesheet" href="http://standino.github.io/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="http://standino.github.io/media/css/prettify.css" type="text/css">

  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">

  <link rel="stylesheet" href="../../../media/css/main.css" type="text/css">
  <link rel="stylesheet" href="../../../media/css/prettify.css" type="text/css">

</head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Keep going</a></h1>
        <p>努力超越自己！</p>
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/html/">Html</a></li>
          <li><a href="/media/">Media</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/wiki/">Wiki</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/standino">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="http://www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="q" value="site:standino.github.io">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>saiku单点登录方案</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">目录&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOC">TOC</span></span></h2>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">基本思路</h2>
<div class="outline-text-2" id="text-2">
<p>
公司已经有了SSO 单点登陆方案。登陆成功后，浏览器中会有加密过的cookie信息。Saiku的安全机制是基于Spring security的。在Spring security中有Pre-Authentication机制。
我们要做的就是实现Pre-Authentication，通过读取公司SSO系统中的cookie信息获得登陆人，并且编写角色赋权的逻辑，然后传给spring security。这样saiku系统就会使用我们传给它的
角色来确定显示哪些cube。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">修改Spring 配置信息</h2>
<div class="outline-text-2" id="text-3">
<p>
修改 /src/main/webapp/WEB-INF/applicationContext-spring-security.xml
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?xml version="1.0" encoding="UTF-8" ?&gt;

&lt;beans xmlns="http://www.springframework.org/schema/beans"
       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
       xsi:schemaLocation="http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans-3.0.xsd"&gt;

  &lt;!-- &lt;import resource="applicationContext-spring-security-memory.xml"/&gt; --&gt;
  &lt;import resource="spring-security.xml"/&gt;
&lt;/beans&gt;
</pre>
</div>

<p>
spring-security.xml
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;beans xmlns="http://www.springframework.org/schema/beans"
       xmlns:security="http://www.springframework.org/schema/security"
       xmlns:context="http://www.springframework.org/schema/context"
       xmlns:oauth="http://www.springframework.org/schema/security/oauth2"
       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
       xsi:schemaLocation="
                           http://www.springframework.org/schema/security http://www.springframework.org/schema/security/spring-security-3.0.xsd
                           http://www.springframework.org/schema/security/oauth2 http://www.springframework.org/schema/security/spring-security-oauth2.xsd
                           http://www.springframework.org/schema/context http://www.springframework.org/schema/context/spring-context-3.0.xsd
                           http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans-3.0.xsd"&gt;

  &lt;context:component-scan base-package="com.standino.ipc.dashboard"/&gt;


  &lt;bean id="ssoHeaderFilter"
        class="com.standino.ipc.dashboard.interceptor.SSORequestHeaderAuthenticationFilter"&gt;
    &lt;property name="principalRequestHeader" value="REMOTE_USER"/&gt;
    &lt;!-- &lt;property name="authenticationManager" ref="authenticationManager"/&gt; --&gt;
    &lt;!-- &lt;property name="allowPreAuthenticatedPrincipals" value="true"/&gt; --&gt;
    &lt;!-- &lt;property name="exceptionIfHeaderMissing" value="false"/&gt; --&gt;
    &lt;!-- &lt;constructor-arg index="0" ref="userDetailsService"/&gt; --&gt;
    &lt;!-- &lt;constructor-arg index="1" ref="ssoLoginHandler"/&gt; --&gt;

    &lt;!-- fall back to other authentication providers is OAM SSO is not there --&gt;
    &lt;property name="exceptionIfHeaderMissing" value="false" /&gt;
    &lt;!-- hard code a testUserId for local tests --&gt;
    &lt;property name="testUserId" value="admin" /&gt;

    &lt;property name="authenticationManager" ref="authenticationManager" /&gt;

    &lt;property name="authenticationDetailsSource"&gt;
      &lt;bean class="com.standino.ipc.dashboard.security.HeaderAuthenticationDetails"&gt;
        &lt;!-- look for the request header set by the webgate and map to local
          roles --&gt;
        &lt;property name="roleHeaderName" value="ROLES" /&gt;
        &lt;property name="userRoles2GrantedAuthoritiesMapper"&gt;
          &lt;bean
            class="org.springframework.security.core.authority.mapping.SimpleAttributes2GrantedAuthoritiesMapper"&gt;
            &lt;property name="convertAttributeToUpperCase" value="true" /&gt;
          &lt;/bean&gt;
        &lt;/property&gt;
        &lt;!-- setup a testing role if not deployed with a webgate - this only
          applies if ENV_NAME != uat/prod --&gt;
        &lt;property name="testingRoles"&gt;
          &lt;set&gt;
            &lt;value&gt;ROLE_ADMIN&lt;/value&gt;
            &lt;value&gt;ROLE_USER&lt;/value&gt;
          &lt;/set&gt;
        &lt;/property&gt;
        &lt;!-- all available roles for this application --&gt;
        &lt;property name="allRoles"&gt;
          &lt;set&gt;
            &lt;value&gt;ROLE_ADMIN&lt;/value&gt;
            &lt;value&gt;ROLE_USER&lt;/value&gt;

          &lt;/set&gt;
        &lt;/property&gt;
      &lt;/bean&gt;
    &lt;/property&gt;


  &lt;/bean&gt;

  &lt;bean id="preauthAuthProvider"
    class="org.springframework.security.web.authentication.preauth.PreAuthenticatedAuthenticationProvider"&gt;
    &lt;property name="preAuthenticatedUserDetailsService" ref="preAuthenticatedUserDetailsService" /&gt;
  &lt;/bean&gt;
  &lt;!-- magically map the user header to a valid user object --&gt;
  &lt;bean id="preAuthenticatedUserDetailsService"
    class="org.springframework.security.web.authentication.preauth.PreAuthenticatedGrantedAuthoritiesUserDetailsService" /&gt;

  &lt;bean id="securityContextHolderAwareRequestFilter"
    class="org.springframework.security.web.servletapi.SecurityContextHolderAwareRequestFilter" /&gt;


  &lt;security:authentication-manager alias="authenticationManager"&gt;
  &lt;security:authentication-provider ref="preauthAuthProvider" /&gt;

  &lt;!-- this is an example of alternate user authentication providers, although
   we only have the PRE_AUTH_FILTER defined above, so it isn't used. --&gt;
  &lt;security:authentication-provider&gt;
   &lt;security:user-service&gt;
    &lt;security:user authorities="ROLE_USER" name="guest" password="guest" /&gt;
   &lt;/security:user-service&gt;
  &lt;/security:authentication-provider&gt;
  &lt;/security:authentication-manager&gt;


  &lt;!-- &lt;security:authentication-manager alias="authenticationManager"&gt; --&gt;
  &lt;!--   &lt;security:authentication-provider user-service-ref='userDetailsService'&gt; --&gt;
  &lt;!--     &lt;security:password-encoder hash="plaintext" /&gt; --&gt;
  &lt;!--   &lt;/security:authentication-provider&gt; --&gt;
  &lt;!-- &lt;/security:authentication-manager&gt; --&gt;

  &lt;bean id="userDetailsService"
        class="com.standino.ipc.dashboard.security.UserDetailsServices" /&gt;

&lt;/beans&gt;
</pre>
</div>
</div>
</div>
